**Источники данных для расчета плотности населения:**

- Датасет buildings.geojson: https://drive.google.com/file/d/1ueVGpQ-3Kpjx38kF-JlEU6seTpezJp9C/view?usp=drive_link
- Реестр домов по Архангельской области: https://аис.фрт.рф/opendata?gid=2216073&cids=house_management&page=1&pageSize=12

Рассматриваемый населенный пункт **г. Архангельск.**  
Данные источников о количестве домов отличаются. Так в датасете список содержит **9600** строк, в реестре домов **4345** строк. На текущий момент для расчетов используется источник с реестром домов, т.к. содержит более полную информацию.  
_!!!В дальнейшем необходимо проработать вопрос о корректности данных источников._

**Исходные данные:** $Vliv$ = население г. Архангельск (2023 г.) = 298 617 чел. (источник https://ru.wikipedia.org/wiki/Архангельск)

**Описание алгоритма расчета:**
1). Использовать данные о домах архангельской области - [https://аис.фрт.рф/opendata?gid=2216073&page=2&pageSize=12](https://xn--80aq1a.xn--p1aee.xn--p1ai/opendata?gid=2216073&page=2&pageSize=12)
2). Сформировать выборку домов г.Архангельск с информацией о жилой площади каждого дома
3). Рассчитать суммарную жилую площадь $Sliv$
4). Рассчитать среднее количество площади на одного жителя г.Архангельск: $$Savg = Vliv/Sliv$$
5). Рассчитать количество жителей на каждый дом, использую жилую площадь дома $Sn$ $$Vn = Sn / Savg$$

**На выходе получаем:** слой с адресом дома и предполагаемым количеством проживающих в нем людей.
